Repository: AnissHal/al_furqan
Catalog: lib/lang/app_*.arb
Languages: ar

# app_title
source: Masjed Al-Sunnah
ar: الماهر بالقرآن

source: Login
ar: تسجيل الدخول

source: Logout
ar: تسجيل الخروج

source: Register
ar: تسجيل

source: Parent
ar: ولي الأمر

source: Student
ar: طالب

source: Parents
ar: أولياء الأمور

source: Students
ar: الطلاب

source: Quran
ar: حفظ القرآن

source: Mutn
ar: حفظ المتن

source: Surah
ar: سورة

source: Ayah
ar: آية

source: Page
ar: صفحة

# from_page
source: From (page number)
ar: من

# to_page
source: To (page number)
ar: إلى

source: Add Teacher
ar: إضافة معلم

source: Present
ar: حاضر

source: Late
ar: متأخر

source: Absent
ar: غائب

source: Phone
ar: الهاتف

source: Username
ar: اسم المستخدم

source: Full Name
ar: الاسم الكامل

source: Age
ar: العمر

source: Teacher Dashboard
ar: لوحة تحكم المعلم

source: Parent Dashboard
ar: لوحة تحكم ولي الأمر

source: Observation
ar: ملاحظة

# mark
source: Mark (on /20)
ar: علامة (على 20)

source: Add Student
ar: إضافة طالب

source: Add Parent
ar: إضافة ولي أمر

source: Update Parent
ar: تحديث ولي الأمر

source: Update Student
ar: تحديث طالب

# student_manage
source: Manage Student
ar: إدارة الطالب

source: No progress yet
ar: لا يوجد تقدمات حتى الان

source: Marked as Present
ar: تم التسجيل كحاضر

source: Marked as Absent
ar: تم التسجيل كغائب

source: Remove Attendance
ar: حذف الحضور

source: Zoom
ar: تكبير

source: Teachers
ar: المعلمين

source: Revision Mutn
ar: المراجعة المتن

source: Revision Quran
ar: المراجعة القرآن

source: Badge
ar: بطاقة

# validation_observation
source: Observation must be less than 100 characters.
ar: يجب أن تكون الملاحظة أقل من 100 حرف.

source: Delete Parent
ar: حذف ولي الأمر

source: Delete Student
ar: حذف طالب

# attendance
source: Attendances
ar: الحضور

source: Search
ar: بحث

source: Search Parent
ar: ابحث عن ولي الأمر

source: Search Student
ar: ابحث عن طالب

source: Search Mutn
ar: ابحث عن متن

source: Add Mutn
ar: اضافة متن

source: Update Mutn
ar: تحديث متن

source: Delete Mutn
ar: حذف متن

# add_surah
source: Add
ar: اضافة

# update_surah
source: Update
ar: تحديث

# delete_surah
source: Delete
ar: حذف

source: Revision Type
ar: نوع المراجعة

source: Revision
ar: مراجعة

source: Request Parent
ar: طلب ولي الأمر

# being_requested
source: You are being requested by the teacher
ar: تم استدعائك من طرف الاستاذ

# stop_request
source: Cancel request
ar: ايقاف الطلب

# parent_already_exists
source: Parent already exists with the same username
ar: ولي الأمر موجود بنفس اسم المستخدم

source: Show All
ar: اظهار الكل

source: Memorization
ar: حفظ

source: Reading
ar: قراءة

source: From Surah
ar: من سورة

source: To Surah
ar: إلى سورة

source: From Ayah
ar: من اية

source: To Ayah
ar: إلى اية

source: From
ar: من

source: To
ar: إلى

source: From Mutn
ar: من متن

source: To Mutn
ar: إلى متن

source: Encouragement
ar: التشجيع

source: Behaviour
ar: السلوك

# encouragement_special
source: You are special
ar: أنت مميز

# encouragement_keepfocus
source: Focus on what benefits you
ar: أحرص على ماينفعك

# encouragement_sucesssoon
source: Success is near
ar: النجاح قريب

# encouragement_makeeffort
source: Do not give up
ar: لاتعجز

# encouragement_godbless
source: May Allah bless you
ar: وفقك الله

# encouragement_greateffort
source: Your effort is great
ar: مجهودك عظيم

# encouragement_progress
source: Great progress
ar: تقدم كبير

# behaviour_studious
source: Studious
ar: مؤدب

# behaviour_talkative
source: Talkative
ar: كثير الكلام

# behaviour_unstudious
source: Unstudious
ar: يلعب في الدرس

# behaviour_notpraying
source: Not Praying
ar: لم يصلي

# add_ayah
source: Add
ar: اضافة

# update_ayah
source: Update
ar: تحديث

# delete_ayah
source: Delete
ar: حذف

source: Add Page
ar: اضافة صفحة

source: Update Page
ar: تحديث صفحة

source: Scan QR Code
ar: مسح رمز الاستجابة السريعة

source: Remove
ar: إزالة

source: Ok
ar: حسنا

# confirm_remove_parent
source: Are you sure you want to remove this parent?
ar: هل أنت متأكد أنك تريد إزالة هذا ولي الأمر؟

# confirm_remove_yourself
source: Are you sure you want to remove yourself?
ar: هل تريد حذف حسابك؟

# teacher_has_student
source: This teacher already has a student, be sure to remove them first.
ar: هذا المعلم لديه طالب تأكد من إزالتهم أولاً.

# parent_has_student
source: This parent already has a student, be sure to remove them first.
ar: هذا ولي الأمر لديه طالب بالفعل، تأكد من إزالتهم أولاً.

source: Close
ar: إغلاق

source: Confirm
ar: تأكيد

source: Cancel
ar: إلغاء

source: Password
ar: كلمة المرور

source: Address
ar: العنوان

source: Save
ar: حفظ

source: Add Picture
ar: اضافة صورة

# form_select_search_parent
source: Select or search a parent
ar: ابحث عن ولي الأمر

# form_select_parent
source: Select a parent
ar: يرجى تحديد ولي الأمر.

# validation_enter_name
source: Please enter the name.
ar: يرجى إدخال الاسم.

# validation_enter_ayah_after_surah
source: Please enter the Ayah number after the Surah number.
ar: يرجى أدخال رقم الآية بعد السورة.

# validation_enter_ayah
source: Please enter the Ayah number.
ar: يرجى أدخال رقم الآية.

# validation_select_surah
source: Please select a Surah before entering the Ayah number.
ar: يرجى تحديد السورة.

# validation_enter_username
source: Please enter the username.
ar: يرجى إدخال اسم المستخدم.

# validation_enter_password
source: Please enter the password.
ar: يرجى إدخال كلمة المرور.

# validation_enter_phone
source: Please enter the phone number.
ar: يرجى إدخال رقم الهاتف.

# validation_select_mutn
source: Please select a Mutn before entering the page number.
ar: يرجى اختيار المتن قبل إدخال رقم الصفحة.

# validation_enter_surah
source: Please enter the Surah before entering the Ayah number.
ar: يرجى إدخال السورة قبل إدخال رقم الآية.

# validation_select_from_page
source: Please select the starting page.
ar: يرجى تحديد الصفحة الأولى.

# validation_select_to_page
source: Please select the ending page.
ar: يرجى تحديد الصفحة الأخيرة.

# validation_enter_full_name
source: Please enter the full name.
ar: يرجى إدخال الاسم الكامل.

# validation_enter_age
source: Please enter the age.
ar: يرجى إدخال العمر.

# validation_enter_address
source: Please enter the address.
ar: يرجى إدخال العنوان.

# validation_select_parent
source: Please select a parent.
ar: يرجى اختيار ولي أمر.

# validation_select_student
source: Please select a student.
ar: يرجى اختيار طالب.

# validation_mark_observation
source: Please add an observation or mark.
ar: يرجى إضافة ملاحظة أو علامة.

# validation_enter_valid_number
source: Please enter a valid number.
ar: يرجى إدخال رقم صحيح.

# surah_exceed_ayahs
source: Surah has only {ayahNumbers} Ayahs, you can't exceed this number.
ar: السورة تحتوي فقط على {ayahNumbers} آيات، لا يمكنك تجاوز هذا العدد.

# mutn_exceed_pages
source: Mutn has only {n} pages.
ar: المتن يحتوي فقط على {n} صفحات.

# page_range_error
source: The beginning page cannot exceed the ending page.
ar: لا يمكن أن تتجاوز الصفحة الأولى الصفحة الأخيرة.

source: No students found.
ar: لم يتم العثور على طلاب.

source: No parents found.
ar: لم يتم العثور على أولياء الأمور.

# error_occurred
source: An error has occurred.
ar: حدث خطأ.

# error_adding_user
source: An error has occurred while adding the user.
ar: حدث خطأ أثناء إضافة المستخدم.

# error_editing_user
source: An error has occurred while editing the user.
ar: حدث خطأ أثناء تعديل المستخدم.

# error_deleting_user
source: An error has occurred while deleting the user.
ar: حدث خطأ أثناء حذف المستخدم.

source: User not found.
ar: المستخدم غير موجود.

source: Wrong password.
ar: كلمة المرور غير صحيحة.

source: Access denied.
ar: تم رفض الوصول.

# unknown_error
source: An unknown error has occurred.
ar: حدث خطأ غير معروف.
